OpenFoam/validation7rod/justFluid/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1000";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField 
{
    "fluid_to_.*"   { type calculated;  value uniform 101325;}
    Inlet           { type calculated;  value uniform 101325;}
    Outlet          { type calculated;  value uniform 101325;}
    Outterwall	    { type calculated;  value uniform 101325;}  
    "symmetry.*"    { type symmetry; }
}


// ************************************************************************* //
