OpenFoam/validation7rod/justFluid/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
convertToMeters 0.001;

vertices
(
    (6 0 0) //0
    (8.125 0 0) //1
    (8.125 4.690970937165709 0) //2
    (5.196152422706632 2.9999999999999996 0) //3
    (6 0 200) //4
    (8.125 0 200) //5
    (8.125 4.690970937165709 200) //6
    (5.196152422706632 2.9999999999999996 200) //7
    (22.25 0 0) //8
    (24.375 0 0) //9
    (24.375 4.690970937165709 0) //10
    (21.446152422706632 2.9999999999999996 0) //11
    (22.25 0 200) //12
    (24.375 0 200) //13
    (24.375 4.690970937165709 200) //14
    (21.446152422706632 2.9999999999999996 200) //15
    (16.25 9.381941874331417 0) //16
    (16.25 6 0) //17
    (16.25 9.381941874331417 200) //18
    (16.25 6 200) //19
    (11.053847577293368 2.9999999999999996 0) //20
    (11.053847577293368 2.9999999999999996 200) //21
    (10.25 0 0) //22
    (10.25 0 200) //23
    (26.843198238411656 4.690970937165709 0) //24
    (27.25 0 0) //25
    (26.843198238411656 4.690970937165709 200) //26
    (27.25 0 200) //27
    (23.599192253125956 13.624999999999998 0) //28
    (23.599192253125956 13.624999999999998 200) //29
);

blocks
(
  hex ( 0 1 2 3 4 5 6 7 ) (15 6 20) simpleGrading (12 1 1)
  hex ( 8 9 10 11 12 13 14 15 ) (15 6 20) simpleGrading (12 1 1)
  hex ( 11 10 16 17 15 14 18 19 ) (15 12 20) simpleGrading (12 1 1)
  hex ( 17 16 2 20 19 18 6 21 ) (15 12 20) simpleGrading (12 1 1)
  hex ( 20 2 1 22 21 6 5 23 ) (15 6 20) simpleGrading (12 1 1)
  hex ( 24 10 9 25 26 14 13 27 ) (15 6 20) simpleGrading (12 1 1)
  hex ( 28 16 10 24 29 18 14 26 ) (15 12 20) simpleGrading (12 1 1)
);

edges
(
    arc 4 7 (5.795554957734409 1.552914270615124 200)
    arc 27 26 (27.148109068558693 2.3542884278781933 200)
    arc 26 29 (25.61372500143396 9.300515660484482 200)
    arc 12 15 (22.04555495773441 1.552914270615124 200)
    arc 15 19 (19.25 5.196152422706632 200)
    arc 19 21 (13.25 5.196152422706632 200)
    arc 21 23 (10.45444504226559 1.552914270615124 200)
    arc 0 3 (5.795554957734409 1.552914270615124 0)
    arc 25 24 (27.148109068558693 2.3542884278781933 0)
    arc 24 28 (25.61372500143396 9.300515660484482 0)
    arc 8 11 (22.04555495773441 1.552914270615124 0)
    arc 11 17 (19.25 5.196152422706632 0)
    arc 17 20 (13.25 5.196152422706632 0)
    arc 20 22 (10.45444504226559 1.552914270615124 0)
);

boundary
(
    Outterwall { type patch; faces ((29 26 24 28)(26 27 25 24));}
    symmetryleft { type symmetry; faces ((5 4 0 1)(23 5 1 22)(13 12 8 9)(27 13 9 25));}
    symmetryrigt { type symmetry; faces ((7 6 2 3)(6 18 16 2)(18 29 28 16));}
    Outlet { type patch; faces ((4 5 6 7)(23 21 6 5)(21 19 18 6)(19 15 14 18)(15 12 13 14)(14 26 29 18)(27 26 14 13));}
    Inlet { type patch; faces ((3 2 1 0)(1 2 20 22)(2 16 17 20)(16 10 11 17)(10 9 8 11)(10 16 28 24)(9 10 24 25));}
    fluid_to_cilcen { type patch; faces ((4 7 3 0));}
    fluid_to_ciltop { type patch; faces ((12 15 11 8)(15 19 17 11)(19 21 20 17)(21 23 22 20));}
);

mergePatchPairs
(
);
